# Missing values - Featue engineering

# Types of data that are missing
1) Missing completely at Random(MCAR): - A data is MCAR if the probability of data being missing is equal for all data . When data us MCAR tere the absolutely no relationship between te data missing and other values, observed r missing , within the dataset .
2) Missing Data not at random: - Systematic missing values : - There is absoluty some relationship between the data missing and other values, observed or missing , within the dataset.
3) Missing at random : -

In [9]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [13]:
df = pd.read_csv('titanic_train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [17]:
## Cabin and Age are related therefore tboth the nan values are related and we cannot say tat both the variables are missing completely at random

In [35]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [31]:
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [37]:
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

# Missing data not at random

In [42]:
df['Cabin_null']  = np.where(df['Cabin'].isnull(),1,0)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_null
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [46]:
## Find percentage of null values
df['Cabin_null'].mean() * 100

77.10437710437711

In [60]:
df.groupby(['Survived'])['Cabin_null'].value_counts()

Survived  Cabin_null
0         1             481
          0              68
1         1             206
          0             136
Name: count, dtype: int64

In [66]:
df.groupby(['Survived'])['Cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: Cabin_null, dtype: float64

In [68]:
df['Survived'].mean()

0.3838383838383838

# Missing At Random

## Techniques of handling missing values
1) mean/median/mode Replacement 
2) Random Sample Imputation
3) Capturing NAN values eith new feature
4) End of Distribution imputation
5) Arbitrary Imputation
6) Freqent Categories Imputation

 ### mean/median/mode Replacement When to apply? 
 Mean/ median has the assumptio that the data are missing completely at random
 solve this by replacing the nan with the most frequent occurance.To vercome outliers we can replace with medan or mode rather than mean